package com.example.eg3_7_fragment;

public final class Data {
    public static final String [] TITLES = {
            "AAAAA",
            "BBBBBB",
            "ACCCC",
    };

    public static final String [] DETAIL = {
      "維基解密發佈了大量被作為頭版新聞報道发布的極其重要的存檔，特別是美國等西方國家的醜聞，早期發佈的文檔包括美國軍隊在阿富汗戰爭中的裝備購置和保養支出，以及其在肯尼亚的腐敗事件等等。[17]2010年4月，维基解密在一個名為「附帶謀殺」（Collateral Murder）的網站上公開了一段2007年7月12日美國軍隊在巴格達空襲時，美軍在巴格達用阿帕契直升機射殺包括數名伊拉克記者在內的無辜平民的視頻。同年7月，维基解密發表阿富汗戰爭日記，內容包含逾76,900份關於阿富汗戰爭文檔，在此之前這些文檔都未曾公開[18]。同年10月，维基解密和主要商業媒體公司合作，又公開了逾400,000份文檔，稱為伊拉克戰爭紀錄。這使得每起在伊拉克，以及跨越伊朗邊界的死亡事件的地点，都可以在地图上找到。[19]2011年4月，維基解密開始公佈與被關押在關塔那摩海灣拘留中心的囚犯有關的779份機密文件",
            "2010年11月，維基解密與全球傳媒集團合作發佈了帶有部分刪節的數萬份美國外交電報。2011年9月1日，一份維基解密的存檔中的美國國務院外交公報的一個未刪節的加密版本曾被通過BitTorrent公佈數月的消息傳開，並且密钥（似乎是密碼）曾被那些知道如何尋找的人利用。維基解密指責它之前的合作夥伴——《衛報》，以及該報記者David Leigh，他在一本2011年出版的書中洩露了密钥[21]，而衛報則辯解是維基解密把事情做得過大以致於使得密钥的洩露只是時間問題。[22]《鏡報》也報導了一個暗示兩邊都出了錯的更加撲朔迷離的故事。[23]這次事故引發了對於電報門事件可能威脅無辜的擔憂。",
            "2010年11月，維基解密與全球傳媒集團合作發佈了帶有部分刪節的數萬份美國外交電報。2011年9月1日，一份維基解密的存檔中的美國國務院外交公報的一個未刪節的加密版本曾被通過BitTorrent公佈數月的消息傳開，並且密钥（似乎是密碼）曾被那些知道如何尋找的人利用。維基解密指責它之前的合作夥伴——《衛報》，以及該報記者David Leigh，他在一本2011年出版的書中洩露了密钥[21]，而衛報則辯解是維基解密把事情做得過大以致於使得密钥的洩露只是時間問題。[22]《鏡報》也報導了一個暗示兩邊都出了錯的更加撲朔迷離的故事。[23]這次事故引發了對於電報門事件可能威脅無辜的擔憂。"
    };


}
